{
  "backend/main.mo": "Motoko backend defining course, gallery, review, contact, inquiry, and user-profile types with map-based storage and authorization mixins.",
  "feature_evidence.json": "Feature report documenting removal of duplicate Contact nav link and its affected frontend file.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based OKLCH color system defining red-white-black theme with light and dark variables.",
  "frontend/index.html": "HTML entry point loading logo asset, Playfair Display font, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider with a Toaster.",
  "frontend/src/components/BrandLogo.tsx": "Logo component that displays the HR Academy logo with optional ACADEMY text styling.",
  "frontend/src/components/Footer.tsx": "Footer showing brand logo, quick links, contact info, and branch locations using fetched backend data.",
  "frontend/src/components/Header.tsx": "Responsive header with Home and Gallery links and a single Contact Us button for desktop and mobile.",
  "frontend/src/components/Layout.tsx": "Layout wrapper rendering Header, Footer, and routed page content.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing.",
  "frontend/src/constants/brandAssets.ts": "Exports the canonical logo asset path used across the application.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and utilities for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend methods, including fetching and mutating courses, images, contact info, reviews, and inquiries.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and custom color variables, including dark mode and accent utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard for managing courses, gallery images, reviews, and contact information with various form handlers.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a form for international inquiries, submitting messages via backend mutation.",
  "frontend/src/pages/CoursesPage.tsx": "Displays courses grouped by category with dynamic badges, loading skeletons, and fetched course data.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery grid using fetched images with loading states and fallbacks when no images are available.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, highlights, contact info, reviews, and review submission logic.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for the frontend styling system.",
  "project_state.json": "Tracks project metadata including architecture notes, known issues, existing features, and current state of a React + Motoko ICP dapp. Provides a comprehensive snapshot used for build planning and issue fixing."
}