{
  "backend/main.mo": "Backend actor defining course data, gallery and review image storage, user profiles, contact info, international inquiries, and access-controlled profile operations with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented client-side image error handling for the Mission section with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens for the red‑white‑black theme and dark-mode variants.",
  "frontend/index.html": "HTML entry point setting favicon, preloading the brand logo, loading fonts, and mounting the frontend app.",
  "frontend/src/App.tsx": "Main React router and theme setup defining all application routes and rendering the layout with Toaster notifications.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component displaying the HR Academy logo with optional text and error handling.",
  "frontend/src/components/Footer.tsx": "Footer showing brand logo, quick links, contact info, and founder attribution using dynamic backend contact data.",
  "frontend/src/components/Header.tsx": "Responsive header with brand logo, navigation links, and a Contact Us button for desktop and mobile.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping pages with header, footer, and main content outlet.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with query cache clearing.",
  "frontend/src/constants/brandAssets.ts": "Centralized constant exporting the canonical HR Academy brand logo path.",
  "frontend/src/constants/missionAssets.ts": "Exports a constant pointing to the fixed mission image asset path.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as courses, gallery images, contact info, and reviews.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, and utility classes including red accent variants.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, contact info, and reviews with various CRUD forms.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with contact info, links, and a form for international inquiries.",
  "frontend/src/pages/CoursesPage.tsx": "Fetches and groups courses by category, rendering category badges and course cards with loading skeletons.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays gallery images in a responsive grid with hover effects, falling back to skeletons or placeholder images.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage with hero content, highlights, reviews, and mission image handling, including review submission logic.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin setup for the project.",
  "project_state.json": "Tracks project state, issues, and feature requests related to fixing the missing Mission section image."
}