{
  "backend/main.mo": "Backend canister defining course, gallery, reviews, contact info, user profiles, and access‑controlled CRUD operations with blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing required frontend static‑asset image handling and homepage mission‑section update with associated components and tests.",
  "frontend-file-summaries.txt": "Reference file summarizing all major frontend components, pages, hooks, and config behavior for the project.",
  "frontend/index.css": "Tailwind base theme file defining OKLCH color variables for light/dark modes and setting global background and text styles.",
  "frontend/index.html": "HTML entry point loading favicon, fonts, and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup using TanStack Router with theme provider and route definitions for all pages.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component rendering the uploaded brand image with optional text display and error fallback.",
  "frontend/src/components/Footer.tsx": "Footer showing logo, quick links, dynamic contact info, and branch details using data from the backend.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation links, and contact button, including mobile sheet menu.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper combining header, routed content, and footer.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears queries on logout.",
  "frontend/src/constants/brandAssets.ts": "Defines the canonical, unmodifiable brand logo path.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing authentication state, login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Contains data-fetching and mutation hooks for courses, gallery images, contact info, reviews, and admin actions using the backend actor.",
  "frontend/src/index.css": "Tailwind configuration defining global styles, dark mode variables, and custom accent-red utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, contact info, review images, and submitted reviews.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact info and a form for international inquiries with validation and toast feedback.",
  "frontend/src/pages/CoursesPage.tsx": "Displays courses grouped by category with loading skeletons and styled category badges.",
  "frontend/src/pages/GalleryPage.tsx": "Fetches and displays gallery images with hover captions, falling back to placeholders if empty.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero content, highlights, contact info, and a review submission form.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, and state for using an uploaded photo unchanged."
}