{
  "backend/main.mo": "Motoko backend defining content types, storage maps, access control, and preview workflow for courses, gallery images, reviews, contact info, and homepage content.",
  "feature_evidence.json": "Report listing features, associated files, components, and test IDs for build-info, diagnostics, and preview-refresh functionality.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, hooks, assets, and configuration files.",
  "frontend/index.css": "Global Tailwind OKLCH theme variables and dark mode values defining the red–white–black color system, plus base element styling.",
  "frontend/index.html": "HTML entry point loading the app root, favicon, preload assets, fonts, and the main React bundle.",
  "frontend/src/App.tsx": "App router setup using TanStack Router with page routes and a ThemeProvider wrapper.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component showing the HR Academy logo with optional text and error handling.",
  "frontend/src/components/Footer.tsx": "Footer displaying branding, contact details, quick links, and build-info values using data from backend queries.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links, contact scroll behavior, and mobile sheet menu.",
  "frontend/src/components/HomeGallerySection.tsx": "Displays featured gallery images with loading and empty states and links to full gallery.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, footer, preview banner, and applies pending contact scroll.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and clearing cached queries.",
  "frontend/src/components/PreviewBanner.tsx": "Shows a preview-mode alert for admins with option to exit preview.",
  "frontend/src/constants/brandAssets.ts": "Exports the canonical brand logo asset path.",
  "frontend/src/constants/buildInfo.ts": "Provides build version and timestamp constants with a formatter function.",
  "frontend/src/constants/missionAssets.ts": "Empty placeholder for mission-related asset constants.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of backend actors tied to identity and refreshes dependent queries.",
  "frontend/src/hooks/useContactScroll.ts": "Handles smooth scrolling to the contact section and pending scroll logic across navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication with login, logout, and status handling.",
  "frontend/src/hooks/usePreviewMode.ts": "Determines preview mode based on URL and admin status and offers enter/exit preview helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating courses, gallery images, contact info, reviews, and related data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, global CSS variables for theming, and custom accent-red utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/AdminPage.tsx": "Implements a comprehensive admin dashboard for managing courses, gallery images, contact info, reviews, and homepage content.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with inquiry form, contact details, social links, and international student section.",
  "frontend/src/pages/CoursesPage.tsx": "Displays all courses grouped by category with loading skeletons and styled category badges.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery grid of uploaded images with hover captions and fallback placeholders when empty.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component displaying hero content, highlights, gallery, contact info, and a user review submission form with preview-mode support.",
  "frontend/src/utils/refreshPreview.ts": "Utility function that clears caches and unregisters service workers before forcing a full page reload to refresh stale previews.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support and persistence utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending color themes, animations, containers, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current build issues, feature status, and pending requests for the HR ACADEMY web application."
}