{
  "backend/main.mo": "Defines types and in-memory maps for courses, images, reviews, contact info, user profiles, and home page content with preview workflow and access control.",
  "feature_evidence.json": "Feature evidence report linking a homepage hero text change to its affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including pages, components, constants, and styling.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and dark mode variables for the red‑white‑black theme.",
  "frontend/index.html": "HTML entry including favicon, preload, root div, and font imports for Playfair Display.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider with Toaster notifications.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component displaying the academy logo image with optional text styling and error fallback.",
  "frontend/src/components/Footer.tsx": "Footer rendering dynamic contact info, about text, social links, and branding with backend-driven content.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation links, and contact button, including responsive mobile sheet menu.",
  "frontend/src/components/HomeGallerySection.tsx": "Renders a gallery section that shows skeletons during loading, a placeholder when empty, or a grid of fetched images.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header, preview banner, routed content, and footer.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button wired to Internet Identity authentication with status handling.",
  "frontend/src/components/PreviewBanner.tsx": "Displays a preview-mode banner for admins with an option to exit preview mode.",
  "frontend/src/constants/brandAssets.ts": "Exports the fixed canonical path for the brand logo asset.",
  "frontend/src/constants/missionAssets.ts": "Empty placeholder file for mission-related asset constants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor instance and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePreviewMode.ts": "Manages preview mode state based on URL params and admin status, with functions to enter or exit preview.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating courses, gallery images, reviews, contact info, and other backend data via the actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for dark theme and accent colors.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the app.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, contact info, reviews, and home page content with multiple forms and upload handlers.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing contact details, social links, and an international inquiry form with submission handling.",
  "frontend/src/pages/CoursesPage.tsx": "Displays courses grouped by category with loading skeletons and styled category labels.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a grid of gallery images with fallback skeletons and default images when no data is available.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, highlights, review submission form, dynamic content, and integrated gallery and review data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, container settings, animations, and plugins.",
  "project_state.json": "Project metadata file describing current state, features, requests, and configuration for the HR Academy project."
}