{
  "backend/main.mo": "Motoko backend defining content types, storage maps, preview workflow, access control, and mixed-in blob storage for images and site data.",
  "feature_evidence.json": "Feature evidence report documenting removal of a Home page CTA section and listing affected frontend file and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files and assets.",
  "frontend/index.css": "Global Tailwind CSS layer defining OKLCH-based red-white-black theme variables and dark-mode overrides.",
  "frontend/index.html": "HTML entry point setting favicon, preload, fonts, and root mount point for the React app.",
  "frontend/src/App.tsx": "Main React entry component setting up TanStack Router routes and wrapping the app with ThemeProvider and Toaster.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo component rendering the brand image with optional text and error fallback.",
  "frontend/src/components/Footer.tsx": "Footer showing contact info, about text, social links, attribution, and dynamic content from backend with preview support.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links and a Contact Us button that triggers smooth scrolling to the footer section.",
  "frontend/src/components/HomeGallerySection.tsx": "Displays featured gallery images with loading and empty states, linking to the full gallery.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header, footer, preview banner, and routed content.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button tied to Internet Identity authentication.",
  "frontend/src/components/PreviewBanner.tsx": "Shows a draft-content preview banner for admins with an option to exit preview mode.",
  "frontend/src/constants/brandAssets.ts": "Exports the canonical unmodifiable brand logo path.",
  "frontend/src/constants/missionAssets.ts": "Empty constants file reserved for mission-related asset paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useContactScroll.ts": "Provides utilities to scroll to the contact section, including deferred scrolling after navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, client creation, and context exposure.",
  "frontend/src/hooks/usePreviewMode.ts": "Handles preview mode state based on URL parameters and admin status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as courses, gallery images, reviews, and contact info.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for the app’s dark theme and accent colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, reviews, contact info, and homepage content with CRUD forms and preview mode.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing contact info and a form for international inquiries with social links and dynamic content.",
  "frontend/src/pages/CoursesPage.tsx": "Displays courses grouped by category with loading skeletons and styled category sections.",
  "frontend/src/pages/GalleryPage.tsx": "Renders gallery images in a responsive grid with loading states and fallback sample images.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, highlights, review submission, gallery section, and dynamic content from backend.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, feature requirements, architectural notes, and current state for the HR ACADEMY site."
}