{
  "backend/main.mo": "Defines course, gallery, review, contact, inquiry, and user-profile types with Map-based storage plus access control and authorization mixins. Implements profile queries and mutations with permission checks.",
  "feature_evidence.json": "Lists feature implementations, affected files, components, and test IDs for recent UI and backend changes with high-confidence evidence entries.",
  "frontend-file-summaries.txt": "Provides short descriptions of all key frontend files, summarizing their purpose and major recent changes related to branding, navigation, reviews, and layout.",
  "frontend/index.css": "Defines global OKLCH-based color tokens and dark-mode variants along with Tailwind base layer styling.",
  "frontend/index.html": "HTML entry point setting up favicon, preload, fonts, metadata, and mounting root for the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/BrandLogo.tsx": "Component that renders the logo image with optional red ACADEMY text and fallback on image load error.",
  "frontend/src/components/Footer.tsx": "Footer rendering logo-only branding, quick links, contact info, and branch details with dynamic data from backend.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links, brand logo, and mobile sheet menu.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper including header, footer, and routed main content.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and status display.",
  "frontend/src/constants/brandAssets.ts": "Exports the fixed canonical path for the brand logo asset.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with stateful identity loading and login handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating courses, gallery images, contact info, and reviews via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and utility classes, including accent-red styling.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, contact info, and reviews, requiring Internet Identity authentication.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that submits international inquiries and displays dynamic contact info with social links.",
  "frontend/src/pages/CoursesPage.tsx": "Displays courses grouped by category with loading skeletons and dynamic styling based on course type.",
  "frontend/src/pages/GalleryPage.tsx": "Fetches and displays gallery images with fallback placeholders and loading skeletons.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring hero content, highlights, contact info, and a review submission form.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, extended OKLCH color tokens, custom animations, and plugin integration for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the ICP full‑stack dapp, its current features, theme system, and functional modules with versioned capability tracking."
}