{
  "backend/main.mo": "Primary backend actor defining data models, preview workflow types, storage mixins, access control, and mutable state for content, courses, images, reviews, inquiries, and user profiles.",
  "backend/migration.mo": "Migration module converting old actor state to the new schema by adding default preview-enabled home page content.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and requirement IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point setting favicon, preload, fonts, and mounting root with main.tsx script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping the app in ThemeProvider and Toaster.",
  "frontend/src/components/BrandLogo.tsx": "Brand logo component displaying the academy logo with optional text and error handling.",
  "frontend/src/components/Footer.tsx": "Renders a footer showing brand info, quick links, and contact details sourced from queries with preview support.",
  "frontend/src/components/Header.tsx": "Implements a responsive site header with navigation links, brand logo, and a mobile sheet menu.",
  "frontend/src/components/HomeGallerySection.tsx": "Displays a gallery section that loads images from a query with loading and empty states.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header, preview banner, routed content, and footer.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button that integrates with Internet Identity and manages auth state.",
  "frontend/src/components/PreviewBanner.tsx": "Shows a preview-mode banner for admins with an option to exit preview.",
  "frontend/src/constants/brandAssets.ts": "Exports the canonical brand logo path used across the app.",
  "frontend/src/constants/missionAssets.ts": "Empty constants file reserved for mission-related assets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, providing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/usePreviewMode.ts": "Controls preview mode based on URL parameters and admin status with enter/exit helpers.",
  "frontend/src/hooks/useQueries.ts": "Contains data-fetching and mutation hooks for courses, gallery images, contact info, reviews, and admin actions via the actor.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom theme variables, and utility classes for a red-accent dark theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing courses, gallery images, contact info, reviews, and homepage content.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and an inquiry form with support for international submissions.",
  "frontend/src/pages/CoursesPage.tsx": "Fetches and displays courses grouped by category with themed styling.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery of uploaded images with loading skeletons and fallback samples.",
  "frontend/src/pages/HomePage.tsx": "React page rendering the home screen with hero content, highlights, contact info, gallery, and a review submission form using query hooks and preview mode.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, including sessionStorage integration and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings, and loading plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing editable content features, preview workflow, existing requirements, and pending feature requests."
}