{
  "kind": "build_request",
  "title": "Fix missing Mission image under “Our Mission” section",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Mission section image loads correctly under the “Our Mission” heading on the Home page by verifying the static asset exists at the exact path referenced by `MISSION_IMAGE_PATH` and is served by the frontend build.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The image isn't loading"
        ]
      },
      "acceptanceCriteria": [
        "The file `frontend/public/assets/generated/img-20260210-wa0017-uploaded.dim_1536x307.jpg` exists in the repo and is included in the deployed frontend build output as a static asset.",
        "Requesting `GET /assets/generated/img-20260210-wa0017-uploaded.dim_1536x307.jpg` returns HTTP 200 and the image bytes.",
        "The image renders on the Home page Mission section without broken-image behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add resilient client-side error handling for the Mission section image element so that if the image fails to load, the UI shows a clear in-page fallback message (English) instead of a broken image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The image isn't loading"
        ]
      },
      "acceptanceCriteria": [
        "If the Mission image fails to load (e.g., by temporarily changing `MISSION_IMAGE_PATH` to an invalid path), the Home page displays a visible fallback message in place of the image.",
        "If the Mission image loads successfully, no fallback message is shown and the layout remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not modify, recompress, resize, convert, rename, or otherwise change the uploaded Mission image file bytes (`img-20260210-wa0017-uploaded.dim_1536x307.jpg`).",
    "Keep using the centralized constant `MISSION_IMAGE_PATH` from `frontend/src/constants/missionAssets.ts` as the source of truth for the Mission image path.",
    "Do not edit files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new images or changing the Mission section copy/layout beyond what is necessary to handle image-load failures.",
    "Changing backend logic or storing the Mission image in the backend blob store."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}