{
  "kind": "build_request",
  "title": "Remove the homepage CTA section ('Ready to Start Your Journey?')",
  "projectName": "HR Academy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Remove the Home page call-to-action section that contains the heading \"Ready to Start Your Journey?\" (including its supporting paragraph and the \"Contact Us Today\" button) so that this section no longer appears anywhere on the site UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remove the \"Ready to start your journey\" part"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the CTA section with the heading \"Ready to Start Your Journey?\" is no longer rendered.",
        "The paragraph \"Join thousands of successful students who have achieved their academic goals with HR Academy\" is no longer visible on the Home page.",
        "The \"Contact Us Today\" button from that CTA section is no longer visible on the Home page.",
        "The Home page layout remains valid and the footer still appears immediately after the preceding content (currently the Reviews section) with no blank/empty CTA area."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components).",
    "Keep the existing Contact Us scroll-to-footer behavior unchanged wherever it remains in the UI."
  ],
  "nonGoals": [
    "Do not change any backend data models or homepage content storage for this request.",
    "Do not change the hero section, gallery section, reviews section, or footer content other than removing the specified CTA section."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}