{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use uploaded photo exactly as-is in Home “Our Mission” section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Copy the uploaded image into frontend public static assets without any processing or modification.",
      "acceptanceCriteria": [
        "A file derived from the user upload \"HR Academy 1-2.jpeg\" exists under frontend/public/assets/generated/ with identical visual content to the upload.",
        "The asset is served directly from the public folder (not through backend blob storage) and is not processed/optimized by any runtime code.",
        "No additional generated/edited variant of the image is created (only a direct copy stored as a static asset)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hr-academy-1-2-uploaded.dim_1280x360.jpeg",
          "operation": "create",
          "description": "Add a direct, byte-for-byte copy of the uploaded file \"HR Academy 1-2.jpeg\" as a static public asset at this exact path/filename; do not resize, recompress, crop, convert, strip metadata, or otherwise alter the file in any way."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render the uploaded image in the Home page “Our Mission” section using a direct static asset <img> reference with no visual-altering styles.",
      "acceptanceCriteria": [
        "The “Our Mission” section on the Home page renders the uploaded photo from the static asset path in frontend/public/assets/generated/.",
        "The rendered image is not clipped (no border-radius masking), not filtered, and not overlaid; it appears as the original rectangular photo.",
        "The image remains responsive (can scale to container width) without changing aspect ratio or cropping any part of the photo."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Mission section image to use src=\"/assets/generated/hr-academy-1-2-uploaded.dim_1280x360.jpeg\" and remove any classes/styles that visually alter the image (e.g., rounded corners/clipping, overlays/opacity, CSS filters, object-fit cropping), keeping it responsive via width scaling with height auto."
        }
      ]
    }
  ]
}